erpdev.СХК_Расширение/src/DataProcessors/Склад/Склад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Склад</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Documents/Расш1_ПоступлениеСклад/Расш1_ПоступлениеСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ПоступлениеСклад</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/Склад/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьТЯчейки()
	Для сч =1 по 22 Цикл
		A = ТЯчейки.Добавить();
		A.ЯчейкаЯчейка = "A"+сч;
		B = ТЯчейки.Добавить();
		B.ЯчейкаЯчейка = "B"+сч;
		C = ТЯчейки.Добавить();
		C.ЯчейкаЯчейка = "C"+сч;
		D = ТЯчейки.Добавить();
		D.ЯчейкаЯчейка = "D"+сч; 
		П = ТЯчейки.Добавить();
		П.ЯчейкаЯчейка = "П"+сч;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБуферТекДень() 
	Б = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Расш1_ПоступлениеСкладТовары.Номенклатура КАК Номенклатура,
	               |	Расш1_ПоступлениеСкладТовары.Серия КАК Серия,
	               |	Расш1_ПоступлениеСкладТовары.Количество КАК Количество,
	               |	Расш1_ПоступлениеСкладТовары.Ячейка КАК Ячейка,
	               |	Расш1_ПоступлениеСкладТовары.Время КАК Время
	               |ИЗ
	               |	Документ.Расш1_ПоступлениеСклад.Товары КАК Расш1_ПоступлениеСкладТовары
	               |ГДЕ
	               |	Расш1_ПоступлениеСкладТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Расш1_ПоступлениеСкладТовары.Ссылка.Проведен = &Проведен
	               |	И Расш1_ПоступлениеСкладТовары.Ссылка.ПометкаУдаления = &ПометкаУдаления"; 
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	БуферТек.Очистить();
	Для Каждого стр из ТабЗнач Цикл
		Т = БуферТек.Добавить();
		Т.Номенклатура = стр.Номенклатура;
		Т.Серия = стр.Серия;
		Т.Количество = стр.Количество;
		Т.Время = стр.Время;
	КонецЦикла;
	
	
		
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБуфер() 
	Б = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество,
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия
				   //|	СХК_ТоварыНаСкладеОстатки.Ячейка.Ряд КАК ЯчейкаРяд
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка.Наименование = &Ячейка"; 
	Запрос.УстановитьПараметр("Ячейка","Буфер");
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	Буфер.Очистить();
	Для Каждого стр из ТабЗнач Цикл
		Т = Буфер.Добавить();
		Т.Номенклатура = стр.Номенклатура;
		Т.Серия = стр.Серия;
		Т.Количество = стр.Количество;
	КонецЦикла;
	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТЯчейки();
	ЗаполнитьБуфер(); 
	ЗаполнитьБуферТекДень();

	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);
	мСкладОформление();
	#Если ВебКлиент Тогда
		Элементы.Номенклатура.Видимость = Ложь;	
	#КонецЕсли
	ПодключитьОбработчикОжидания("ОбработчикКарта", 30);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКарта()    

	ЗаполнитьТЯчейки();
	ЗаполнитьБуфер(); 
	ЗаполнитьБуферТекДень();

	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);
	мСкладОформление();
	
КонецПроцедуры

&НаСервере 
Процедура мСкладОформление()
	мСклад.АвтоМасштаб = Истина;
	
	
КонецПроцедуры


&НаСервере  
Функция	ЗаполнитьТЧ(НомП)
	
	Если Пользователи.АвторизованныйПользователь().Наименование = "tsdsmartbar" Тогда
		Веб = Истина;
	Иначе
		Веб = Ложь;
	КонецЕсли;
	
	
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум.Очистить();  
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетСклад"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СТРОКА(СХК_ТоварыНаСкладеОстатки.Ячейка.Секция) + СТРОКА(СХК_ТоварыНаСкладеОстатки.Ячейка.Ячейка) КАК ЯчейкаЯчейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка.Ряд КАК ЯчейкаРяд
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка.ПометкаУдаления = &ПометкаУдаления"; 
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	
	Ряд1 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд1");
	Ряд2 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд2");
	Ряд3 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд3");
	Ряд4 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд4");
	Ряд5 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд5");
	Ряд6 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд6");
	Ряд7 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд7");
	Ряд8 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд8");
	Ряд10 = Макет.ПолучитьОбласть("Область1011|Ряд10");
	Ряд11 = Макет.ПолучитьОбласть("Область1011|Ряд11");
	Ряд9 = Макет.ПолучитьОбласть("Область9");


	//Для Каждого стр из Ряд1.Параметры Цикл 
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("ЯчейкаРяд","1"); 
	//	Отбор.Вставить("ЯчейкаЯчейка",стр); 
	//	Строки = ТабЗнач.НайтиСтроки(Отбор); 
	//	Если Строки.Количество() = 1 Тогда
	//		Ряд1.Параметры[стр] = Строки[0].Номенклатура;	
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	
	Для Каждого стр из ТЯчейки Цикл
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","1");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд1.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд1.Параметры[стр.ЯчейкаЯчейка] = Н ;
		КонецЕсли;	
		Ряд1.Параметры.П1 = "проход ряд 1" ;

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","2");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд2.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд2.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	
		Ряд2.Параметры.П1 = "проход ряд 2" ;

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","3");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд3.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд3.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;
		Ряд3.Параметры.П1 = "проход ряд 3" ;
		
//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","4");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд4.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд4.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	
		Ряд4.Параметры.П1 = "проход ряд 4" ;

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","5");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд5.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд5.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	                     
		Ряд5.Параметры.П1 = "проход ряд 5" ;
		

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","6");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд6.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд6.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;
		Ряд6.Параметры.П1 = "проход ряд 6" ;
		

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","7");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд7.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд7.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;
		Ряд7.Параметры.П1 = "проход ряд 7" ;
		

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","8");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд8.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд8.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;
		Ряд8.Параметры.П1 = "проход ряд 8" ;
		

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","10");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд10.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;			КонецЦикла;
			Ряд10.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","11");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд11.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд11.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;
		Ряд11.Параметры.П1 = "проход ряд 1" ;
		
//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","9");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд9.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд9.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;
		Ряд9.Параметры.П1 = "проход ряд 9" ;
 		Ряд9.Параметры.ОстатокБуфер = Буфер.Итог("Количество");

	КонецЦикла;
	
	ТаблДокум.Вывести(Ряд10);
	ТаблДокум.Присоединить(Ряд11);
	
	ТаблДокум.Вывести(Ряд1);

	ТаблДокум.Присоединить(Ряд2);
	ТаблДокум.Присоединить(Ряд3);
	ТаблДокум.Присоединить(Ряд4);
	ТаблДокум.Присоединить(Ряд5);
	ТаблДокум.Присоединить(Ряд6);
	ТаблДокум.Присоединить(Ряд7);
	ТаблДокум.Присоединить(Ряд8);
	ТаблДокум.Вывести(Ряд9);
	
 
	 Для а = 1 по ТаблДокум.ВысотаТаблицы Цикл 
		Для б = 1 по ТаблДокум.ШиринаТаблицы Цикл
			текстЯчейка = ТаблДокум.Область("R"+а+"C"+б).Текст; 
			Если стрДлина(текстЯчейка) > 20 Тогда
				Если ТипЗнч(НомП) = Тип("СправочникСсылка.Номенклатура") И ЭтаФорма.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда 
					Если НомП.Наименование = текстЯчейка Тогда
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Синий;
						Если Веб = Истина Тогда
							ТаблДокум.Область("R"+а+"C"+б).ЦветТекста = WebЦвета.Синий;
						КонецЕсли;
					ИначеЕсли СтрНайти(текстЯчейка, НомП.Наименование) Тогда 
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Синий; 
						Если Веб = Истина Тогда
							ТаблДокум.Область("R"+а+"C"+б).ЦветТекста = WebЦвета.Синий;
						КонецЕсли;
						
					Иначе
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = Новый Цвет(255,124,128);
						Если Веб = Истина Тогда
							ТаблДокум.Область("R"+а+"C"+б).ЦветТекста = Новый Цвет(255,124,128);
						КонецЕсли;
						
					КонецЕсли;
				ИначеЕсли ТипЗнч(НомП) = Тип("Массив") Тогда  
					спрН = Справочники.Номенклатура.НайтиПоНаименованию(текстЯчейка).Ссылка;
					Индекс = НомП.Найти(спрН);
					Если Индекс <> Неопределено Тогда
                    	ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Синий;
						Если Веб = Истина Тогда
							ТаблДокум.Область("R"+а+"C"+б).ЦветТекста = WebЦвета.Синий;
						КонецЕсли;
						
					ИНаче
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = Новый Цвет(255,124,128); 
						Если Веб = Истина Тогда
							ТаблДокум.Область("R"+а+"C"+б).ЦветТекста = Новый Цвет(255,124,128); 
						КонецЕсли;
						
					КонецЕсли;	
				Иначе
					Если ТаблДокум.Область("R"+а+"C"+б).Расшифровка = Неопределено Тогда
						
					Иначе
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = Новый Цвет(255,124,128); 
						Если Веб = Истина Тогда
							ТаблДокум.Область("R"+а+"C"+б).ЦветТекста = Новый Цвет(255,124,128); 
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	 
	Возврат ТаблДокум;
	
КонецФункции

&НаКлиенте
Процедура Тест(Команда)
	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);
	мСкладОформление();	
	ЗаполнитьБуфер();
	ЗаполнитьБуферТекДень();
КонецПроцедуры  

&НаСервере  
Функция	ЗаполнитьТЗОрдер()
	Док = ЭтаФорма.РасходныйОрдер.ПолучитьОбъект();
	Мас = Док.ОтгружаемыеТовары.ВыгрузитьКолонку("Номенклатура");//Таб.ВыгрузитьКолонку("Фрукт");
	Возврат Мас;
КонецФункции


	
&НаКлиенте
Процедура РасходныйОрдерПриИзменении(Элемент)
	ЭтаФорма.Номенклатура = "";	 
	ТЗ = ЗаполнитьТЗОрдер();
	Если ТЗ.Количество() >= 1 Тогда
		мСклад = ЗаполнитьТЧ(ТЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент) 
	ЭтаФорма.РасходныйОрдер =  "";
	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);	
КонецПроцедуры

&НаКлиенте
Процедура мСкладОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры
